In [2]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [3]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [18]:
df.iloc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [ ]:
loc: It is primarily label-based. This means that when you use loc, you specify the row and column labels you want to access.
It can accept boolean arrays as well, enabling you to perform conditional selection. When using loc, both the start and stop values are inclusive.

iloc: It is integer-location based. This means that when you use iloc, you specify rows and columns by their integer index position. 
It doesn't include the end index in the range, similar to Python's slicing.

In [13]:
new_df = df.reindex([3,0,1,2])

In [14]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [15]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [17]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [ ]:
Yes i observe a difference between both the outputs.
In loc i get the data which is on the actual position given in the assignment.
but In iloc i get the new data which i get by reindexing.

In [19]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [20]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.873790  0.972303  0.239220  0.494026  0.777964  0.125706
2  0.226532  0.092288  0.477108  0.594875  0.314672  0.495303
3  0.890590  0.944520  0.854684  0.462071  0.690273  0.180094
4  0.031511  0.965343  0.102615  0.997949  0.393133  0.068632
5  0.156824  0.573380  0.801655  0.561831  0.305141  0.630198
6  0.817738  0.381079  0.079976  0.462713  0.273385  0.845300

In [21]:
df1.mean()

column_1    0.499498
column_2    0.654819
column_3    0.425876
column_4    0.595577
column_5    0.459095
column_6    0.390872
dtype: float64

In [26]:
df1['column_2'].std()

0.3685523425325443

In [31]:
df1.iloc[1] = 1.67888

In [32]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.873790  0.972303  0.239220  0.494026  0.777964  0.125706
2  1.678880  1.678880  1.678880  1.678880  1.678880  1.678880
3  0.890590  0.944520  0.854684  0.462071  0.690273  0.180094
4  0.031511  0.965343  0.102615  0.997949  0.393133  0.068632
5  0.156824  0.573380  0.801655  0.561831  0.305141  0.630198
6  0.817738  0.381079  0.079976  0.462713  0.273385  0.845300

In [33]:
df1['column_2'].mean()

0.9192508259413086

In [ ]:
No i did not get any error

In [ ]:
In pandas, the window functions are used for performing calculations on a specified window of data. 
These functions enable you to compute aggregations, transformations, and other operations on subsets of your data, often defined by rolling windows or expanding windows. 
The window functions allow you to work with data in a more flexible and dynamic way, especially when analyzing time series or sequential data.

In [45]:
date = pd.date_range(start= '2024-01-8' , end = '2024-03-8')

In [46]:
date

DatetimeIndex(['2024-01-08', '2024-01-09', '2024-01-10', '2024-01-11',
               '2024-01-12', '2024-01-13', '2024-01-14', '2024-01-15',
               '2024-01-16', '2024-01-17', '2024-01-18', '2024-01-19',
               '2024-01-20', '2024-01-21', '2024-01-22', '2024-01-23',
               '2024-01-24', '2024-01-25', '2024-01-26', '2024-01-27',
               '2024-01-28', '2024-01-29', '2024-01-30', '2024-01-31',
               '2024-02-01', '2024-02-02', '2024-02-03', '2024-02-04',
               '2024-02-05', '2024-02-06', '2024-02-07', '2024-02-08',
               '2024-02-09', '2024-02-10', '2024-02-11', '2024-02-12',
               '2024-02-13', '2024-02-14', '2024-02-15', '2024-02-16',
               '2024-02-17', '2024-02-18', '2024-02-19', '2024-02-20',
               '2024-02-21', '2024-02-22', '2024-02-23', '2024-02-24',
               '2024-02-25', '2024-02-26', '2024-02-27', '2024-02-28',
               '2024-02-29', '2024-03-01', '2024-03-02', '2024-03-03',
               '2024-03-04', '2024-03-05', '2024-03-06', '2024-03-07',
               '2024-03-08'],
              dtype='datetime64[ns]', freq='D')

In [59]:
starting_datetime = pd.Timedelta(days= 1,hours = 5 , minutes=45, seconds = 33) 
ending_datetime = pd.Timedelta(days= 7,hours = 8 , minutes= 35, seconds = 50)

In [60]:
time_diff = ending_datetime - starting_datetime

In [61]:
time_diff

Timedelta('6 days 02:50:17')

In [62]:
df2 = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [72]:
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [64]:
df2.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [65]:
cat = pd.Categorical(df2)

In [66]:
cat

['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', ..., 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
Length: 12
Categories (12, object): ['Age', 'Cabin', 'Embarked', 'Fare', ..., 'Sex', 'SibSp', 'Survived', 'Ticket']

In [73]:
sorted_df = df2.sort_values('Pclass')

In [74]:
sorted_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S
310,311,1,1,"Hays, Miss. Margaret Bechstein",female,24.0,0,0,11767,83.1583,C54,C
309,310,1,1,"Francatelli, Miss. Laura Mabel",female,30.0,0,0,PC 17485,56.9292,E36,C
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9000,C65,C
306,307,1,1,"Fleming, Miss. Margaret",female,NaN,0,0,17421,110.8833,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
379,380,0,3,"Gustafsson, Mr. Karl Gideon",male,19.0,0,0,347069,7.7750,NaN,S
381,382,1,3,"Nakid, Miss. Maria (""Mary"")",female,1.0,0,2,2653,15.7417,NaN,C
382,383,0,3,"Tikkanen, Mr. Juho",male,32.0,0,0,STON/O 2. 3101293,7.9250,NaN,S
371,372,0,3,"Wiklund, Mr. Jakob Alfred",male,18.0,1,0,3101267,6.4958,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [77]:
df3 = pd.read_csv("https://gist.github.com/pyPRO2019/dc44ae45f7cfe2f2a34fec30db4678eb.js")

In [92]:
student_data = {"Student ID" : [1,2,3,4,5,6,7,8,9,10],
    "Test Score" : [85,90,80,75,85,82,78,85,90,85]}

In [93]:
df4 = pd.DataFrame(student_data)

In [94]:
df4

   Student ID  Test Score
0           1          85
1           2          90
2           3          80
3           4          75
4           5          85
5           6          82
6           7          78
7           8          85
8           9          90
9          10          85

In [99]:
df4.mean()

Student ID     5.5
Test Score    83.5
dtype: float64

In [100]:
df4.median()

Student ID     5.5
Test Score    85.0
dtype: float64

In [101]:
df4.mode()

   Student ID  Test Score
0           1        85.0
1           2         NaN
2           3         NaN
3           4         NaN
4           5         NaN
5           6         NaN
6           7         NaN
7           8         NaN
8           9         NaN
9          10         NaN